#include<stdio.h>
int main(){
/*
等腰三角形 
    *
   ***
  *****
 *******
********* 
由空格和*两部分构成
		第1行：4空1* 	第2行：3空3* 	第3行：2空5* 	第4行：1空7* 	第5行：0空9*
空格数为：5-1             5-2             5-3             5-4             5-5 
  * 数为：2-1             4-1             6-1             8-1             10-1
规律：空格为5-i 	*为2*i-1 
//*/ 
//	int i,j;
//	for(i=1;i<=5;i++){
//		//先输出空格 
//		for(j=1;j<=5-i;j++){
//			putchar(' ');
//		}
//		for(j=1;j<=2*i-1;j++){
//			printf("*");
//		}
//		putchar('\n');
//	}
//	
/*
倒等腰三角形 
 *******
  *****
   ***
    *
*/ 
//	int i,j;
//	for(i=1;i<=4;i++){
//		for(j=1;j<=i;j++){
//			putchar(' ');
//		}
//		for(j=1;j<=2*(5-i)-1;j++){
//			printf("*");
//		}
//		putchar('\n');
//	}	
	
/*
    *
   ***
  *****
 *******
********* 
 *******
  *****
   ***
    * 
由等腰三角形 + 倒等腰三角形组成， 
*/ 
	int i,j;
	for(i=1;i<=5;i++){
		//先输出空格 
		for(j=1;j<=5-i;j++){
			putchar(' ');
		}
		for(j=1;j<=2*i-1;j++){
			printf("*");
		}
		putchar('\n');
	}
	for(i=1;i<=4;i++){
		for(j=1;j<=i;j++){
			putchar(' ');
		}
		for(j=1;j<=2*(5-i)-1;j++){
			printf("*");
		}
		putchar('\n');
	}	

	return 0;
}


