#include<stdio.h>
//循环嵌套执行步骤：先找规律，外层循环执行一次，内层循环执行一周 
//打印平面图形的方法：外层循环控制行数，内层循环控制每次打印的次数 
int main(){
/*
输出如下图形
***** 
***** 
***** 
***** 
*/
	int a,b;
	for(a=1;a<=4;a++){
		for(b=1;b<=5;b++){
				printf("*");
			}
		printf("\n");
	}

/*
1 2  3  4  5
2 4  6  8 10
3 6  9 12 15
4 8 12 16 20 
输出以上矩阵
规律： 
1*1 1*2 1*3 1*4 1*5 
2*1 2*2 2*3 2*4 2*5 
3*1 3*2 3*3 3*4 3*5 
4*1 4*2 4*3 4*4 4*5 
每一行的乘数都是对应的行数，可以用外层循环 i 表示行
每一行的被乘数都是*1 *2 *3 *4 *5，可以用内层循环 k 表示
*/
//	int i,k;
//	for(i=1;i<=4;i++){
//		for(k=1;k<=5;k++){
//				printf("%d\t",i*k);
//			}
//		printf("\n");
//	}
	return 0;
} 
